content/topics/wellbeing_economy.md
+++
title = "Wellbeing economy"
author = ["Dorneanu"]
tags = ["economics", "philosophy"]
draft = false
+++

## Overview {#overview}

A wellbeing economy is an economic system explicitly designed to deliver human and ecological wellbeing rather than to maximise GDP growth. The term encompasses several related frameworks — the Wellbeing Economy Alliance (WEAll), New Zealand's Living Standards Framework, Scotland and Iceland's Wellbeing Economy Governments partnership, and Kate Raworth's doughnut economics — all of which redefine success by measuring what actually matters to people and to the biosphere.

The core critique: GDP measures the volume of monetised transactions, not whether those transactions increase flourishing. GDP rises when people get sick and need treatment; it rises when forests are cleared for agriculture; it does not capture inequality, leisure, unpaid care work, or ecological health. A wellbeing economy substitutes richer metrics covering income security, health, education, environmental quality, and social connection.


## Earth for All and the wellbeing economy {#earth-for-all-and-the-wellbeing-economy}

"Earth for All" (Club of Rome, 2022) treats the wellbeing economy as the destination that the [Giant Leaps]({{< relref "giant_leaps.md" >}}) are designed to reach. The book argues:

-   Developed economies approaching or past "peak wellbeing" — additional GDP growth adds little to life satisfaction but significant environmental damage
-   Emerging economies still need real improvements in material living standards, but through clean technology pathways, not fossil-fuel replication
-   The goal is to decouple human flourishing from physical throughput — more wellbeing, less material consumption

The Earth4All model (see [Earth4All model]({{< relref "earth4all_model.md" >}})) uses wellbeing indicators alongside GDP to evaluate scenarios: the Giant Leaps scenario produces markedly better wellbeing outcomes while keeping resource consumption closer to [Planetary boundaries]({{< relref "planetary_boundaries.md" >}}).


## Relation to doughnut economics {#relation-to-doughnut-economics}

Kate Raworth's doughnut economics framework (2017) is a close relative: the doughnut's inner ring (social foundation) corresponds to the wellbeing floor, while its outer ring (ecological ceiling) maps directly onto planetary boundaries. Earth for All can be read as a quantitative, policy-operational version of the doughnut — specifying which interventions cross the social floor without breaching the ecological ceiling.


## GDP beyond GDP {#gdp-beyond-gdp}

Key alternative metrics proposed within wellbeing economy frameworks:

-   **Genuine Progress Indicator (GPI)** — adjusts GDP for inequality, unpaid work, environmental costs, and defensive expenditures
-   **Human Development Index (HDI)** — UN composite of income, health, and education
-   **Wellbeing scores** — Cantril ladder, subjective life satisfaction surveys
-   **Planetary health check** — dashboard of [Planetary boundaries]({{< relref "planetary_boundaries.md" >}}) indicators
-   **Inclusive Wealth Index** — World Bank; values produced capital, human capital, and natural capital


## Degrowth vs green growth {#degrowth-vs-green-growth}

The wellbeing economy sits at the contested border between degrowth and green growth. Degrowth advocates argue GDP must shrink in rich nations to stay within planetary limits; green growth advocates argue decoupling — producing more value with less material throughput — is achievable at scale. Earth for All takes a pragmatic middle position: rich nations should prioritise wellbeing and allow GDP to plateau or decline if necessary; developing nations need growth but through clean technology. The authors call this "post-growth" rather than degrowth, reserving degrowth for contexts where material throughput must fall.


## Resources {#resources}

-   2026-06-05 ◦ [Earth for All — Dixson-Declève et al. (Club of Rome, 2022)](https://www.goodreads.com/book/show/60321399-earth-for-all) — wellbeing economy as the explicit goal of the Giant Leaps; argues developed nations are past peak wellbeing-GDP return; discusses decoupling and post-growth framing
